testCases/JungKim/constant/fluid/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/fluid/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    front
    {
        type            wedge;
        inGroups        1(wedge);
        nFaces          38400;
        startFace       76400;
    }
    back
    {
        type            wedge;
        inGroups        1(wedge);
        nFaces          38400;
        startFace       114800;
    }
    right
    {
        type            patch;
        nFaces          240;
        startFace       153200;
    }
    fluid_to_solid
    {
        type            patch;
        nFaces          160;
        startFace       153440;
    }
    top
    {
        type            patch;
        nFaces          160;
        startFace       153600;
    }
    axis
    {
        type            empty;
        inGroups        1(empty);
        nFaces          240;
        startFace       153760;
    }
)

// ************************************************************************* //
