testCases/JungKim/constant/fluid/runParams
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      runParams;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
// Define mesh variables 
Lx      4e-3;     // X length in m

Ly  6e-3;    // Y length in m

dx     0.025e-3;   // Grid size in m (25 micrometers)

theta   5.0;     // Wedge Angle in degrees (5 degrees)

pi 	3.14159265359;

// Derived quantities

nX     #calc "$Lx / $dx";          // Number of cells in x-direction

nY     #calc "$Ly / $dx";    // Number of cells in y-direction

Lz     #calc "$Lx*$theta/2*$pi/180";

// Heat Flux

q	114e3; // Heat flux from heater in Watts

// Fluid params

psat 	1.013e5;

g	9.81;

rhol 	958;

mul	2.8e-4;

betal	2.68e-4;

cpl 	4.22e3;

kappal	0.679;

rhov 	0.597;

muv	1.26e-5;

betav	0.0029;

cpv 	2.03e3;

kappav	2.5e-2;

hfg	2.26e6;

sigma	0.059;

Tsat 	373.15;

CA	38.0;

// Initial Seed Radius

seedRadius	60e-6;

// Initial Seed height

seedCentreHeight	#calc "$seedRadius * cos($CA * $pi / 180)";

// Wall superheat

dT	9;

// Activation Temperature

Tact	#calc "$Tsat + $dT";

// Bulk Temperature

Tbulk	$Tsat;

// Thermal boundary layer thickness

blThickness	#calc "7.14 * Foam::pow($mul * $kappal / ($rhol * $rhol * $cpl * $betal * $dT), 1./3)";


